Autodesk.Revit.DB.ExtrusionAnalyzer.Create(Autodesk.Revit.DB.Solid,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.XYZ)
Creates an ExtrusionAnalyzer and computes and stores the solid's shadow.
solidGeometry:
The geometry to analyze.
plane:
The plane to use for the base plane for the extrusion.
direction:
The direction to use for the calculation for the extrusion.
Returns:
The newly created ExtrusionAnalyzer object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input direction must be transverse to the input plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A failure occurred in creating the ExtrusionAnalyzer or computing the solid's shadow.
Since:
2012